读写文本格式的数据

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('ex1.txt')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.txt', sep = ',')

c:\users\administrator\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('ex2.txt', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('ex2.txt', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names = ['a', 'b', 'c', 'd', 'message']

In [8]:
pd.read_csv('ex2.txt', names=names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv('ex3.txt', index_col = ['key1', 'key2'])

In [10]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
list(open('ex4.txt'))

['        A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [12]:
result = pd.read_table('ex4.txt', sep = '\s+')

c:\users\administrator\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [13]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
pd.read_csv('ex5.txt', skiprows = [0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
result = pd.read_csv('ex6.txt')

In [16]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('ex6.txt', na_values = ['Null'])

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.options.display.max_rows = 10

In [21]:
data = pd.read_csv('ex6.txt')

In [22]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
data.to_csv('out.csv')

In [24]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [25]:
import sys

In [26]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [27]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [28]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [29]:
dates = pd.date_range('1/1/2000', periods=7)

In [30]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [31]:
ts = pd.Series(np.arange(7), index=dates)

In [32]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [33]:
ts.to_csv('tseries.csv')

c:\users\administrator\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [34]:
!type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [35]:
import csv

In [36]:
f = open('ex8.csv')

In [37]:
reader  = csv.reader(f)

In [38]:
reader

In [39]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [40]:
with open('ex8.csv') as f:
    lines = list(csv.reader(f))

In [41]:
header, values = lines[0], lines[1:]

In [42]:
data.dict = {h: v for h, v in zip(header, zip(*values))}

c:\users\administrator\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [43]:
data.dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [44]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [45]:
import json

In [46]:
result = json.loads(obj)

In [47]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [48]:
asjson = json.dumps(result)

In [49]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])

In [50]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [51]:
data = pd.read_json('example.json')

In [52]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [53]:
from lxml.html import parse

In [54]:
tables = pd.read_html('ex9.htm')

In [55]:
len(tables)

1

In [56]:
failures = tables[0]

In [57]:
failures.head()

                 0     1      2     3      4
0             考生编号  考生姓名    总成绩  初试成绩   复试成绩
1  106109108080009    寸馨  76.28   207  83.56
2  106109108080015   伍亚萍   70.5   191  77.33
3  106109108080026    蒲杨  66.61   184  71.89
4  106109108080017    杨梅  64.89   197  64.11

In [58]:
frame = pd.read_csv('ex1.txt')

In [59]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [60]:
store = pd.HDFStore('mydata.h5')

In [61]:
store['obj1'] = frame

In [62]:
store['obj_col']  = frame['a']

In [63]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [64]:
store['obj1']

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [65]:
xlsx = pd.ExcelFile('ex10.xlsx')

In [66]:
pd.read_excel(xlsx, 'Sheet1')

            1 2    15   156   48 message
0      15s   2s    ds   ndo   15   kjnck
1      156  sdu  slid  1568  djs     NaN
2  jdsjs15  NaN   484  husi   65     NaN

In [67]:
import requests

In [68]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [69]:
resp = requests.get(url)

In [70]:
resp

In [71]:
data = resp.json()

In [72]:
data[0]['title']

'Fix type annotations in pandas.core.resample'

In [73]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [74]:
issues

,number,title,labels,state
0,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
1,26397,DataFrame.describe excludes top and freq for e...,[],open
2,26396,CLN: remove compat.lrange,"[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
3,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
4,26394,"pd.to_numeric(..., errors='ignore') returns Na...","[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
...,...,...,...,...
25,26359,BUG: groupby.agg returns incorrect results for...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,26356,BUG: Exception when frame constructed from dic...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26355,BUG: Fix MultiIndex DataFrame to_csv() segfault,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
28,26354,[ENH] ExtensionArray.argsort places the missin...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
29,26353,Add na_filter documentation to read_excel,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open

In [75]:
import sqlite3

In [76]:
query = """
.....: CREATE TABLE test
.....: (a VARCHAR(20), b VARCHAR(20),
.....: c REAL, d INTEGER
.....: );"""

In [77]:
con = sqlite3.connect('mydata.sqlite')

In [82]:
con.execute(query)

OperationalError: table test already exists

In [83]:
con.commit()

In [84]:
data = [('Atlanta', 'Georgia', 1.25, 6),
.....: ('Tallahassee', 'Florida', 2.6, 3),
.....: ('Sacramento', 'California', 1.7, 5)]

In [85]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [86]:
con.executemany(stmt, data)

In [87]:
con.commit()

In [88]:
cursor = con.execute('select * from test')

In [89]:
rows = cursor.fetchall()

In [90]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [91]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [92]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [93]:
import sqlalchemy as sqla

In [94]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [95]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5